keerthi176/Cygnus_MVE/FirmwareDevelopment/CIE_Panel_F7/Source/Mori/Middlewares/ST/STM32_USB_Host_Library/Class/FTDI/usbh_ftdi.c
/**
  ******************************************************************************
  * @file    usbh_cdc.c
  * @author  MCD Application Team
  * @brief   This file is the CDC Layer Handlers for USB Host CDC class.
  *
  *  @verbatim
  *
  *          ===================================================================
  *                                CDC Class Driver Description
  *          ===================================================================
  *           This driver manages the "Universal Serial Bus Class Definitions for Communications Devices
  *           Revision 1.2 November 16, 2007" and the sub-protocol specification of "Universal Serial Bus
  *           Communications Class Subclass Specification for PSTN Devices Revision 1.2 February 9, 2007"
  *           This driver implements the following aspects of the specification:
  *             - Device descriptor management
  *             - Configuration descriptor management
  *             - Enumeration as CDC device with 2 data endpoints (IN and OUT) and 1 command endpoint (IN)
  *             - Requests management (as described in section 6.2 in specification)
  *             - Abstract Control Model compliant
  *             - Union Functional collection (using 1 IN endpoint for control)
  *             - Data interface class
  *
  *  @endverbatim
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2015 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                      http://www.st.com/SLA0044
  *
  ******************************************************************************
  */

  /* BSPDependencies
  - "stm32xxxxx_{eval}{discovery}{nucleo_144}.c"
  - "stm32xxxxx_{eval}{discovery}_io.c"
  - "stm32xxxxx_{eval}{discovery}{adafruit}_sd.c"
  - "stm32xxxxx_{eval}{discovery}{adafruit}_lcd.c"
  - "stm32xxxxx_{eval}{discovery}_sdram.c"
  EndBSPDependencies */

/* Includes ------------------------------------------------------------------*/
#include "usbh_ftdi.h"
 
	
void db( const char* fmt, ... ); 

/** @addtogroup USBH_LIB
* @{
*/

/** @addtogroup USBH_CLASS
* @{
*/

/** @addtogroup USBH_FTDI_CLASS
* @{
*/

/** @defgroup USBH_FTDI_CORE
* @brief    This file includes CDC Layer Handlers for USB Host CDC class.
* @{
*/

/** @defgroup USBH_FTDI_CORE_Private_TypesDefinitions
* @{
*/
/**
* @}
*/


/** @defgroup USBH_FTDI_CORE_Private_Defines
* @{
*/
#define USBH_FTDI_BUFFER_SIZE                 1024
/**
* @}
*/


/** @defgroup USBH_FTDI_CORE_Private_Macros
* @{
*/
/**
* @}
*/


/** @defgroup USBH_FTDI_CORE_Private_Variables
* @{
*/
/**
* @}
*/


/** @defgroup USBH_FTDI_CORE_Private_FunctionPrototypes
* @{
*/


static USBH_StatusTypeDef Reset( USBH_HandleTypeDef *phost ); 
static USBH_StatusTypeDef SetBaud(USBH_HandleTypeDef *phost, int baud );
	
	

static USBH_StatusTypeDef USBH_FTDI_InterfaceInit  (USBH_HandleTypeDef *phost);

static USBH_StatusTypeDef USBH_FTDI_InterfaceDeInit  (USBH_HandleTypeDef *phost);

static USBH_StatusTypeDef USBH_FTDI_Process(USBH_HandleTypeDef *phost);

static USBH_StatusTypeDef USBH_FTDI_SOFProcess(USBH_HandleTypeDef *phost);

static USBH_StatusTypeDef USBH_FTDI_ClassRequest (USBH_HandleTypeDef *phost);

static USBH_StatusTypeDef GetLineCoding(USBH_HandleTypeDef *phost,
                                                 FTDI_LineCodingTypeDef *linecoding);

static USBH_StatusTypeDef SetLineCoding(USBH_HandleTypeDef *phost,
                                                 FTDI_LineCodingTypeDef *linecoding);

static void FTDI_ProcessTransmission(USBH_HandleTypeDef *phost);

static void FTDI_ProcessReception(USBH_HandleTypeDef *phost);

USBH_ClassTypeDef  FTDI_Class =
{
  "FTDI",
  VENDOR_SPECIFIC,
  USBH_FTDI_InterfaceInit,
  USBH_FTDI_InterfaceDeInit,
  USBH_FTDI_ClassRequest,
  USBH_FTDI_Process,
  USBH_FTDI_SOFProcess,
  NULL,
};
/**
* @}
*/


/** @defgroup USBH_FTDI_CORE_Private_Functions
* @{
*/


static int ftdi_convert_baudrate(int baudrate, FTDI_HandleTypeDef* ftdi,
										 unsigned short *value, unsigned short *index);


static FTDI_HandleTypeDef ftdi_handle = { 0 };

/**
  * @brief  USBH_FTDI_InterfaceInit
  *         The function init the CDC class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_FTDI_InterfaceInit (USBH_HandleTypeDef *phost)
{

  USBH_StatusTypeDef status = USBH_FAIL ;
  uint8_t interface;
  FTDI_HandleTypeDef *FTDI_Handle;

  interface = USBH_FindInterface(phost,
                                 VENDOR_SPECIFIC,		// Class  
                                 VENDOR_SPECIFIC,		// SubClass
                                 VENDOR_SPECIFIC  );	// Protocol

  if(interface == 0xFFU) /* No Valid Interface */
  {
		db( "Cannot Find the interface for Device Class.", phost->pActiveClass->Name );
  }
  else
  {
    USBH_SelectInterface( phost, interface );
	  
//	 FTDI_Handle = phost->USBH_ClassTypeDef_pData[phost->interfaces] =  (FTDI_HandleTypeDef *)USBH_malloc (sizeof(FTDI_HandleTypeDef));
	 FTDI_Handle = phost->USBH_ClassTypeDef_pData[phost->interfaces] = &ftdi_handle;	// only 1 ftdi device sorry. 
	 memset( &ftdi_handle, 0, sizeof( ftdi_handle ) );   
	   
    phost->interfaces++;
	  
    FTDI_Handle->CommItf.NotifPipe = NULL;

#ifdef NOTIFY_INTERFACE
    /*Collect the notification endpoint address and length*/
	 
    if(phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[0].bEndpointAddress & 0x80U)
    {
      FTDI_Handle->CommItf.NotifEp = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[0].bEndpointAddress;
		                               
      FTDI_Handle->CommItf.NotifEpSize  = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[0].wMaxPacketSize;
    }

    /*Allocate the length for host channel number in*/
    FTDI_Handle->CommItf.NotifPipe = USBH_AllocPipe(phost, FTDI_Handle->CommItf.NotifEp);

    /* Open pipe for Notification endpoint */
    USBH_OpenPipe  (phost,
                    FTDI_Handle->CommItf.NotifPipe,
                    FTDI_Handle->CommItf.NotifEp,
                    phost->device.address,
                    phost->device.speed,
                    USB_EP_TYPE_INTR,
                    FTDI_Handle->CommItf.NotifEpSize);

