keerthi176/Cygnus_MVE/FirmwareDevelopment/CIE_Panel_F7/Source/Mori/Middlewares/ST/STM32_USB_Host_Library/Class/FTDI/usbh_ftdi.c
    USBH_LL_SetToggle (phost, FTDI_Handle->CommItf.NotifPipe, 0U);
#endif
	 
     //USBH_FindInterface(phost,
                    //               DATA_INTERFACE_CLASS_CODE,
                      //             RESERVED,
                        //           NO_CLASS_SPECIFIC_PROTOCOL_CODE);

    if(interface == 0xFFU) /* No Valid Interface */
    {
      USBH_DbgLog ("Cannot Find the interface for Data Interface Class.", phost->pActiveClass->Name);
    }
    else
    {
      /*Collect the class specific endpoint address and length*/
      if(phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[0].bEndpointAddress & 0x80U)
      {
        FTDI_Handle->DataItf.InEp = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[0].bEndpointAddress;
        FTDI_Handle->DataItf.InEpSize  = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[0].wMaxPacketSize;
      }
      else
      {
        FTDI_Handle->DataItf.OutEp = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[0].bEndpointAddress;
        FTDI_Handle->DataItf.OutEpSize  = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[0].wMaxPacketSize;
      }

      if(phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[1].bEndpointAddress & 0x80U)
      {
        FTDI_Handle->DataItf.InEp = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[1].bEndpointAddress;
        FTDI_Handle->DataItf.InEpSize  = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[1].wMaxPacketSize;
      }
      else
      {
        FTDI_Handle->DataItf.OutEp = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[1].bEndpointAddress;
        FTDI_Handle->DataItf.OutEpSize  = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[1].wMaxPacketSize;
      }

      /*Allocate the length for host channel number out*/
      FTDI_Handle->DataItf.OutPipe = USBH_AllocPipe(phost, FTDI_Handle->DataItf.OutEp);

      /*Allocate the length for host channel number in*/
      FTDI_Handle->DataItf.InPipe = USBH_AllocPipe(phost, FTDI_Handle->DataItf.InEp);

      /* Open channel for OUT endpoint */
      USBH_OpenPipe  (phost,
                      FTDI_Handle->DataItf.OutPipe,
                      FTDI_Handle->DataItf.OutEp,
                      phost->device.address,
                      phost->device.speed,
                      USB_EP_TYPE_BULK,
                      FTDI_Handle->DataItf.OutEpSize);
      /* Open channel for IN endpoint */
      USBH_OpenPipe  (phost,
                      FTDI_Handle->DataItf.InPipe,
                      FTDI_Handle->DataItf.InEp,
                      phost->device.address,
                      phost->device.speed,
                      USB_EP_TYPE_BULK,
                      FTDI_Handle->DataItf.InEpSize);

      FTDI_Handle->state = FTDI_IDLE_STATE;
		FTDI_Handle->req_stage = REQ_RESET;

      USBH_LL_SetToggle (phost, FTDI_Handle->DataItf.OutPipe, 0U);
      USBH_LL_SetToggle (phost, FTDI_Handle->DataItf.InPipe, 0U);
		
		
		
		 // Try to guess chip type
		// Bug in the BM type chips: bcdDevice is 0x200 for serial == 0
		if ( phost->device.DevDesc.bcdDevice == 0x400 ||
				( phost->device.DevDesc.bcdDevice == 0x200 && phost->device.DevDesc.iSerialNumber == 0 ))			
			FTDI_Handle->type = TYPE_BM;
		else if (phost->device.DevDesc.bcdDevice == 0x200)
			 FTDI_Handle->type = TYPE_AM;
		else if (phost->device.DevDesc.bcdDevice == 0x500)
			 FTDI_Handle->type = TYPE_2232C;
		else if (phost->device.DevDesc.bcdDevice == 0x600)
			 FTDI_Handle->type = TYPE_R;
		else if (phost->device.DevDesc.bcdDevice == 0x700)
			 FTDI_Handle->type = TYPE_2232H;
		else if (phost->device.DevDesc.bcdDevice == 0x800)
			 FTDI_Handle->type = TYPE_4232H;
		else if (phost->device.DevDesc.bcdDevice == 0x900)
			 FTDI_Handle->type = TYPE_232H;
		else if (phost->device.DevDesc.bcdDevice == 0x1000)
			 FTDI_Handle->type = TYPE_230X;
					
      status = USBH_OK;
    }
  }
  return status;
}



/**
  * @brief  USBH_FTDI_SetBAUD
  *         The function DeInit the Pipes used for the CDC class.
  * @param  phost: Host handle
  * @param  rate: BAUD rate
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_FTDI_SetBAUD(USBH_HandleTypeDef *phost, uint32_t rate )
{
	return SetBaud( phost, rate );
}


/**
  * @brief  USBH_FTDI_InterfaceDeInit
  *         The function DeInit the Pipes used for the CDC class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_FTDI_InterfaceDeInit (USBH_HandleTypeDef *phost)
{
	uint8_t idx = 0;
	for(; idx < phost->interfaces; ++idx)
	{
		FTDI_HandleTypeDef *FTDI_Handle = phost->USBH_ClassTypeDef_pData[idx];
  
	  if ( FTDI_Handle->CommItf.NotifPipe)
	  {
		 USBH_ClosePipe(phost, FTDI_Handle->CommItf.NotifPipe);
		 USBH_FreePipe  (phost, FTDI_Handle->CommItf.NotifPipe);
		 FTDI_Handle->CommItf.NotifPipe = 0U;     /* Reset the Channel as Free */
	  }

	  if ( FTDI_Handle->DataItf.InPipe)
	  {
		 USBH_ClosePipe(phost, FTDI_Handle->DataItf.InPipe);
		 USBH_FreePipe  (phost, FTDI_Handle->DataItf.InPipe);
		 FTDI_Handle->DataItf.InPipe = 0U;     /* Reset the Channel as Free */
	  }

	  if ( FTDI_Handle->DataItf.OutPipe)
	  {
		 USBH_ClosePipe(phost, FTDI_Handle->DataItf.OutPipe);
		 USBH_FreePipe  (phost, FTDI_Handle->DataItf.OutPipe);
		 FTDI_Handle->DataItf.OutPipe = 0U;    /* Reset the Channel as Free */
	  }
	   
		phost->USBH_ClassTypeDef_pData[idx] = NULL;
  }
	
  phost->interfaces = 0;	
  
  return USBH_OK;
}

static uint8_t rxdata[ 64];
/**
  * @brief  USBH_FTDI_ClassRequest
  *         The function is responsible for handling Standard requests
  *         for CDC class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_FTDI_ClassRequest (USBH_HandleTypeDef *phost)
{
   USBH_StatusTypeDef status = USBH_OK ;
	
	uint8_t idx = phost->device.current_interface;
	FTDI_HandleTypeDef *FTDI_Handle = phost->USBH_ClassTypeDef_pData[ idx];

	switch ( FTDI_Handle->req_stage )
	{
		case REQ_RESET :
		{
			status = Reset( phost );
	
		 	if ( status == USBH_OK )
			{
				FTDI_Handle->req_stage = REQ_SET_BAUD;
			}
			else break;
		}
		case REQ_SET_BAUD :
		{
			status = SetBaud( phost, 115200 );
	
		   if( status == USBH_OK )
		   {
			    FTDI_Handle->req_stage = REQ_SET_CONFIG;
		   }
			else break;
		}
		case REQ_SET_CONFIG :
		{
			status = USBH_FTDI_Setup( phost, FTDI_SIO_SET_DATA_STOP_BITS_1, FTDI_SIO_SET_DATA_PARITY_NONE, 8 );
			
			if( status == USBH_OK )
		   {
			   phost->pUser( phost, HOST_USER_CLASS_ACTIVE );
				
