keerthi176/Cygnus_MVE/FirmwareDevelopment/CIE_Panel_F7/Source/Mori/Middlewares/ST/STM32_USB_Host_Library/Class/FTDI/usbh_ftdi.c
				// Start receving
 			   USBH_FTDI_Receive( phost, rxdata, 64 ); 
		   }
		}
   }
   return status;
}


/**
  * @brief  USBH_FTDI_Process
  *         The function is for managing state machine for CDC data transfers
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_FTDI_Process (USBH_HandleTypeDef *phost)
{
   USBH_StatusTypeDef status = USBH_BUSY;
   USBH_StatusTypeDef req_status = USBH_OK;
	
	uint8_t idx = phost->device.current_interface;
	FTDI_HandleTypeDef *FTDI_Handle = phost->USBH_ClassTypeDef_pData[ idx];
   
   switch ( FTDI_Handle->state )
   {

  case FTDI_IDLE_STATE:
    status = USBH_OK;
    break;

  case FTDI_SET_LINE_CODING_STATE:
    req_status = SetLineCoding(phost, FTDI_Handle->pUserLineCoding);

    if(req_status == USBH_OK)
    {
      FTDI_Handle->state = FTDI_GET_LAST_LINE_CODING_STATE;
    }

    else
    {
      if(req_status != USBH_BUSY)
      {
        FTDI_Handle->state = FTDI_ERROR_STATE;
      }
    }
    break;


  case FTDI_GET_LAST_LINE_CODING_STATE:
    req_status = GetLineCoding(phost, &(FTDI_Handle->LineCoding));

    if(req_status == USBH_OK)
    {
      FTDI_Handle->state = FTDI_IDLE_STATE;

      if((FTDI_Handle->LineCoding.b.bCharFormat == FTDI_Handle->pUserLineCoding->b.bCharFormat) &&
         (FTDI_Handle->LineCoding.b.bDataBits == FTDI_Handle->pUserLineCoding->b.bDataBits) &&
         (FTDI_Handle->LineCoding.b.bParityType == FTDI_Handle->pUserLineCoding->b.bParityType) &&
         (FTDI_Handle->LineCoding.b.dwDTERate == FTDI_Handle->pUserLineCoding->b.dwDTERate))
      {
        USBH_FTDI_LineCodingChanged(phost);
      }
    }
    else
    {
      if(req_status != USBH_BUSY)
      {
        FTDI_Handle->state = FTDI_ERROR_STATE;
      }
    }
    break;

  case FTDI_TRANSFER_DATA:
    FTDI_ProcessTransmission(phost);
    FTDI_ProcessReception(phost);
    break;

  case FTDI_ERROR_STATE:
    req_status = USBH_ClrFeature(phost, 0x00U);

    if(req_status == USBH_OK )
    {
      /*Change the state to waiting*/
      FTDI_Handle->state = FTDI_IDLE_STATE ;
    }
    break;

  default:
    break;

  }

  return status;
}

/**
  * @brief  USBH_FTDI_SOFProcess
  *         The function is for managing SOF callback
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_FTDI_SOFProcess (USBH_HandleTypeDef *phost)
{
  return USBH_OK;
}


/**
  * @brief  USBH_FTDI_Stop
  *         Stop current CDC Transmission
  * @param  phost: Host handle
  * @retval USBH Status
  */
USBH_StatusTypeDef  USBH_FTDI_Stop(USBH_HandleTypeDef *phost)
{
  uint8_t idx = phost->device.current_interface;
	FTDI_HandleTypeDef *FTDI_Handle = phost->USBH_ClassTypeDef_pData[ idx];
	
  if(phost->gState == HOST_CLASS)
  {
    FTDI_Handle->state = FTDI_IDLE_STATE;

  //  USBH_ClosePipe(phost, FTDI_Handle->CommItf.NotifPipe);
    USBH_ClosePipe(phost, FTDI_Handle->DataItf.InPipe);
    USBH_ClosePipe(phost, FTDI_Handle->DataItf.OutPipe);
  }
  return USBH_OK;
}


static USBH_StatusTypeDef Reset( USBH_HandleTypeDef *phost )
{
   uint8_t idx = phost->device.current_interface;
	FTDI_HandleTypeDef *FTDI_Handle = phost->USBH_ClassTypeDef_pData[ idx];

   // if (libusb_control_transfer(ftdi->usb_dev, FTDI_DEVICE_OUT_REQTYPE,
   //                             SIO_RESET_REQUEST, SIO_RESET_SIO,
   //                             ftdi->index, NULL, 0, ftdi->usb_write_timeout) < 0)
   //     ftdi_error_return(-1,"FTDI reset failed");

    // Invalidate data in the readbuffer
   FTDI_Handle->readbuffer_offset = 0;
   FTDI_Handle->readbuffer_remaining = 0;
	 
	phost->Control.setup.b.bmRequestType = FTDI_DEVICE_OUT_REQTYPE;
                                          

	phost->Control.setup.b.bRequest = FTDI_SIO_RESET; // SIO_SET_BAUDRATE_REQUEST
	 
  
	phost->Control.setup.b.wValue.w = 0;

	phost->Control.setup.b.wIndex.w = 1;

	phost->Control.setup.b.wLength.w = 0;

	return USBH_CtlReq(phost, NULL, 0 );
}
 

static USBH_StatusTypeDef SetBaud(USBH_HandleTypeDef *phost, int baudrate )
{
	uint8_t idx = phost->device.current_interface;
	FTDI_HandleTypeDef *FTDI_Handle = phost->USBH_ClassTypeDef_pData[ idx];
	
   unsigned short value, index;
    int actual_baudrate;

     
    if (FTDI_Handle->bitbang_enabled)
    {
        baudrate = baudrate*4;
    }

    actual_baudrate = ftdi_convert_baudrate(baudrate, FTDI_Handle, &value, &index);
	 
    if (actual_baudrate <= 0)
	 {
		db( "USB - Silly baudrate <= 0.");
		 return USBH_FAIL;
	 }
	 
    // Check within tolerance (about 5%)
    if ((actual_baudrate * 2 < baudrate /* Catch overflows */ )
            || ((actual_baudrate < baudrate)
                ? (actual_baudrate * 21 < baudrate * 20)
                : (baudrate * 21 < actual_baudrate * 20)))
	 {
        db( "Unsupported baudrate. Note: bitbang baudrates are automatically multiplied by 4");
		 return USBH_FAIL;
	 }
 
    FTDI_Handle->baudrate = baudrate;      
       // uint8_t rv = pUsb->ctrlReq(bAddress, 0, bmREQ_FTDI_OUT, FTDI_SIO_SET_BAUD_RATE, baud_value & 0xff, baud_value >> 8, baud_index, 0, 0, NULL, NULL);
		  
	phost->Control.setup.b.bmRequestType = FTDI_DEVICE_OUT_REQTYPE;
                                          

	phost->Control.setup.b.bRequest = FTDI_SIO_SET_BAUD_RATE; // SIO_SET_BAUDRATE_REQUEST
  
	phost->Control.setup.b.wValue.w = value;

	phost->Control.setup.b.wIndex.w = index;

	phost->Control.setup.b.wLength.w = 0;

	return USBH_CtlReq(phost, NULL, 0 );
}
/**
  * @brief  This request allows the host to find out the currently
  *         configured line coding.
  * @param  pdev: Selected device
  * @retval USBH_StatusTypeDef : USB ctl xfer status
  */
static USBH_StatusTypeDef GetLineCoding(USBH_HandleTypeDef *phost, FTDI_LineCodingTypeDef *linecoding)
{

  phost->Control.setup.b.bmRequestType = USB_D2H | USB_REQ_TYPE_CLASS | \
                              USB_REQ_RECIPIENT_INTERFACE;

  phost->Control.setup.b.bRequest = FTDI_GET_LINE_CODING;
  phost->Control.setup.b.wValue.w = 0U;
  phost->Control.setup.b.wIndex.w = 0U;
  phost->Control.setup.b.wLength.w = LINE_CODING_STRUCTURE_SIZE;

  return USBH_CtlReq(phost, linecoding->Array, LINE_CODING_STRUCTURE_SIZE);
}


/**
  * @brief  This request allows the host to specify typical asynchronous
  * line-character formatting properties
  * This request applies to asynchronous byte stream data class interfaces
  * and endpoints
  * @param  pdev: Selected device
  * @retval USBH_StatusTypeDef : USB ctl xfer status
  */
static USBH_StatusTypeDef SetLineCoding(USBH_HandleTypeDef *phost,
                                        FTDI_LineCodingTypeDef *linecoding)
{
  phost->Control.setup.b.bmRequestType = USB_H2D | USB_REQ_TYPE_CLASS |
                                         USB_REQ_RECIPIENT_INTERFACE;

  phost->Control.setup.b.bRequest = FTDI_SET_LINE_CODING;
  phost->Control.setup.b.wValue.w = 0U;

