keerthi176/Cygnus_MVE/FirmwareDevelopment/CIE_Panel_F7/Source/Mori/Middlewares/ST/STM32_USB_Host_Library/Class/FTDI/usbh_ftdi.c
  phost->Control.setup.b.wIndex.w = 0U;

  phost->Control.setup.b.wLength.w = LINE_CODING_STRUCTURE_SIZE;

  return USBH_CtlReq(phost, linecoding->Array, LINE_CODING_STRUCTURE_SIZE);
}

/**
* @brief  This function prepares the state before issuing the class specific commands
* @param  None
* @retval None
*/
USBH_StatusTypeDef USBH_FTDI_SetLineCoding(USBH_HandleTypeDef *phost,
                                          FTDI_LineCodingTypeDef *linecoding)
{
  uint8_t idx = phost->device.current_interface;
  FTDI_HandleTypeDef *FTDI_Handle = phost->USBH_ClassTypeDef_pData[ idx];
	
  if(phost->gState == HOST_CLASS)
  {
    FTDI_Handle->state = FTDI_SET_LINE_CODING_STATE;
    FTDI_Handle->pUserLineCoding = linecoding;

#if (USBH_USE_OS == 1U)
    phost->os_msg = (uint32_t)USBH_CLASS_EVENT;
#if (osCMSIS < 0x20000U)
    (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
    (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
  }

  return USBH_OK;
}

/**
* @brief  This function prepares the state before issuing the class specific commands
* @param  None
* @retval None
*/
USBH_StatusTypeDef  USBH_FTDI_GetLineCoding(USBH_HandleTypeDef *phost,
                                           FTDI_LineCodingTypeDef *linecoding)
{
  uint8_t idx = phost->device.current_interface;
  FTDI_HandleTypeDef *FTDI_Handle = phost->USBH_ClassTypeDef_pData[ idx];
	
  if((phost->gState == HOST_CLASS) || (phost->gState == HOST_CLASS_REQUEST))
  {
    *linecoding = FTDI_Handle->LineCoding;
    return USBH_OK;
  }
  else
  {
    return USBH_FAIL;
  }
}

	/* break_state = -1 to turn on break, and 0 to turn off break */
	/* see drivers/char/tty_io.c to see it used */
	/* last_set_data_value NEVER has the break bit set in it */

USBH_StatusTypeDef USBH_FTDI_BreakCtrl( USBH_HandleTypeDef *phost, int break_state )
{
   uint8_t idx = phost->device.current_interface;
   FTDI_HandleTypeDef *FTDI_Handle = phost->USBH_ClassTypeDef_pData[ idx];
		 
	uint16_t value;
   
	if (break_state)
		value = FTDI_Handle->last_set_data_value | FTDI_SIO_SET_BREAK;
	else
		value = FTDI_Handle->last_set_data_value;

	phost->Control.setup.b.bmRequestType = FTDI_SIO_SET_DATA_REQUEST_TYPE;                                          
	phost->Control.setup.b.bRequest = FTDI_SIO_SET_DATA;  
	phost->Control.setup.b.wValue.w = value;
	phost->Control.setup.b.wIndex.w = FTDI_Handle->interface;
	phost->Control.setup.b.wLength.w = 0;
 
	return USBH_CtlReq(phost, NULL, 0 );
}


USBH_StatusTypeDef USBH_FTDI_Setup( USBH_HandleTypeDef *phost, uint16_t stopbits, uint16_t parity, uint16_t databits )
{
	uint8_t idx = phost->device.current_interface;
   FTDI_HandleTypeDef *FTDI_Handle = phost->USBH_ClassTypeDef_pData[ idx];
		 
	uint16_t value;
  
	value = 0;
	value |= stopbits;
	value |= parity;
	value |= databits;

	/* This is needed by the break command since it uses the same command
	   - but is or'ed with this value  */
	FTDI_Handle->last_set_data_value = value;
	
	phost->Control.setup.b.bmRequestType = FTDI_SIO_SET_DATA_REQUEST_TYPE;                                          
	phost->Control.setup.b.bRequest = FTDI_SIO_SET_DATA;  
	phost->Control.setup.b.wValue.w = value;
	phost->Control.setup.b.wIndex.w = FTDI_Handle->interface;
	phost->Control.setup.b.wLength.w = 0;
 
	return USBH_CtlReq(phost, NULL, 0 );
}


/**
  * @brief  This function return last received data size
  * @param  None
  * @retval None
  */
uint16_t USBH_FTDI_GetLastReceivedDataSize(USBH_HandleTypeDef *phost)
{
  uint32_t dataSize;
  uint8_t idx = phost->device.current_interface;
  FTDI_HandleTypeDef *FTDI_Handle = phost->USBH_ClassTypeDef_pData[ idx];
	

  if(phost->gState == HOST_CLASS)
  {
    dataSize = USBH_LL_GetLastXferSize(phost, FTDI_Handle->DataItf.InPipe);
  }
  else
  {
    dataSize =  0U;
  }

  return (uint16_t)dataSize;
}

/**
  * @brief  This function prepares the state before issuing the class specific commands
  * @param  None
  * @retval None
  */
USBH_StatusTypeDef  USBH_FTDI_Transmit(USBH_HandleTypeDef *phost, const uint8_t *pbuff, uint32_t length)
{
  USBH_StatusTypeDef Status = USBH_BUSY;
  uint8_t idx = phost->device.current_interface;
  FTDI_HandleTypeDef *FTDI_Handle = phost->USBH_ClassTypeDef_pData[ idx];
	
  if((FTDI_Handle->state == FTDI_IDLE_STATE) || (FTDI_Handle->state == FTDI_TRANSFER_DATA))
  {
    FTDI_Handle->pTxData = (uint8_t *) pbuff;
    FTDI_Handle->TxDataLength = length;
    FTDI_Handle->state = FTDI_TRANSFER_DATA;
    FTDI_Handle->data_tx_state = FTDI_SEND_DATA;
    Status = USBH_OK;

#if (USBH_USE_OS == 1U)
    phost->os_msg = (uint32_t)USBH_CLASS_EVENT;
#if (osCMSIS < 0x20000U)
    (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
    (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
  }
  return Status;
}


/**
* @brief  This function prepares the state before issuing the class specific commands
* @param  None
* @retval None
*/
USBH_StatusTypeDef  USBH_FTDI_Receive(USBH_HandleTypeDef *phost, uint8_t *pbuff, uint32_t length)
{
  USBH_StatusTypeDef Status = USBH_BUSY;
  uint8_t idx = phost->device.current_interface;
  FTDI_HandleTypeDef *FTDI_Handle = phost->USBH_ClassTypeDef_pData[ idx];
		
  if((FTDI_Handle->state == FTDI_IDLE_STATE) || (FTDI_Handle->state == FTDI_TRANSFER_DATA))
  {
    FTDI_Handle->pRxData = pbuff;
    FTDI_Handle->RxDataLength = length;
    FTDI_Handle->state = FTDI_TRANSFER_DATA;
    FTDI_Handle->data_rx_state = FTDI_RECEIVE_DATA;
    Status = USBH_OK;

#if (USBH_USE_OS == 1U)
    phost->os_msg = (uint32_t)USBH_CLASS_EVENT;
#if (osCMSIS < 0x20000U)
    (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
    (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
  }
  return Status;
}

/**
* @brief  The function is responsible for sending data to the device
*  @param  pdev: Selected device
* @retval None
*/
static void FTDI_ProcessTransmission(USBH_HandleTypeDef *phost)
{
  uint8_t idx = phost->device.current_interface;
  FTDI_HandleTypeDef *FTDI_Handle = phost->USBH_ClassTypeDef_pData[ idx];
	
  USBH_URBStateTypeDef URB_Status = USBH_URB_IDLE;

  switch (FTDI_Handle->data_tx_state)
  {
  case FTDI_SEND_DATA:
    if (FTDI_Handle->TxDataLength > FTDI_Handle->DataItf.OutEpSize)
    {
      USBH_BulkSendData (phost,
                         FTDI_Handle->pTxData,
                         FTDI_Handle->DataItf.OutEpSize,
                         FTDI_Handle->DataItf.OutPipe,
                         1U);
    }
    else
    {
      USBH_BulkSendData (phost,
                         FTDI_Handle->pTxData,
                         (uint16_t)FTDI_Handle->TxDataLength,
                         FTDI_Handle->DataItf.OutPipe,
                         1U);
    }

    FTDI_Handle->data_tx_state = FTDI_SEND_DATA_WAIT;
    break;

