keerthi176/Cygnus_MVE/FirmwareDevelopment/CIE_Panel_F7/Source/Mori/Middlewares/ST/STM32_USB_Host_Library/Class/FTDI/usbh_ftdi.c
  case FTDI_SEND_DATA_WAIT:

    URB_Status = USBH_LL_GetURBState(phost, FTDI_Handle->DataItf.OutPipe);

    /* Check the status done for transmission */
    if (URB_Status == USBH_URB_DONE)
    {
      if (FTDI_Handle->TxDataLength > FTDI_Handle->DataItf.OutEpSize)
      {
        FTDI_Handle->TxDataLength -= FTDI_Handle->DataItf.OutEpSize;
        FTDI_Handle->pTxData += FTDI_Handle->DataItf.OutEpSize;
      }
      else
      {
        FTDI_Handle->TxDataLength = 0U;
      }

      if (FTDI_Handle->TxDataLength > 0U)
      {
        FTDI_Handle->data_tx_state = FTDI_SEND_DATA;
      }
      else
      {
        FTDI_Handle->data_tx_state = FTDI_IDLE;
        USBH_FTDI_TransmitCallback(phost);
      }

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_CLASS_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
    }
    else
    {
      if (URB_Status == USBH_URB_NOTREADY)
      {
        FTDI_Handle->data_tx_state = FTDI_SEND_DATA;

#if (USBH_USE_OS == 1U)
        phost->os_msg = (uint32_t)USBH_CLASS_EVENT;
#if (osCMSIS < 0x20000U)
        (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
      }
    }
    break;

  default:
    break;
  }
}
/**
* @brief  This function responsible for reception of data from the device
*  @param  pdev: Selected device
* @retval None
*/


static void FTDI_ProcessReception(USBH_HandleTypeDef *phost)
{
  uint8_t idx = phost->device.current_interface;
  FTDI_HandleTypeDef *FTDI_Handle = phost->USBH_ClassTypeDef_pData[ idx];
	
  USBH_URBStateTypeDef URB_Status = USBH_URB_IDLE;
  uint32_t length;

  switch(FTDI_Handle->data_rx_state)
  {

  case FTDI_RECEIVE_DATA:

    USBH_BulkReceiveData (phost,
                          FTDI_Handle->pRxData,
                          FTDI_Handle->DataItf.InEpSize,
                          FTDI_Handle->DataItf.InPipe);

    FTDI_Handle->data_rx_state = FTDI_RECEIVE_DATA_WAIT;

    break;

  case FTDI_RECEIVE_DATA_WAIT:

    URB_Status = USBH_LL_GetURBState(phost, FTDI_Handle->DataItf.InPipe);

    /*Check the status done for reception*/
    if(URB_Status == USBH_URB_DONE)
    {
      length = USBH_LL_GetLastXferSize(phost, FTDI_Handle->DataItf.InPipe);

      if(((FTDI_Handle->RxDataLength - length) > 0U) && (length > FTDI_Handle->DataItf.InEpSize))
      {
        FTDI_Handle->RxDataLength -= length ;
        FTDI_Handle->pRxData += length;
        FTDI_Handle->data_rx_state = FTDI_RECEIVE_DATA;
      }
      else
      {
        FTDI_Handle->data_rx_state = FTDI_IDLE;
		  if ( length > 2 )
		  {
			  USBH_FTDI_ReceiveCallback( phost, FTDI_Handle->pRxData + 2, length - 2);
		  }
		  USBH_FTDI_Receive( phost, rxdata, 64 ); // ask for more
      }

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_CLASS_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
    }
    break;

  default:
    break;
  }
}

/**
* @brief  The function informs user that data have been received
*  @param  pdev: Selected device
* @retval None
*/
__weak void USBH_FTDI_TransmitCallback(USBH_HandleTypeDef *phost)
{

}

  /**
* @brief  The function informs user that data have been sent
*  @param  pdev: Selected device
* @retval None
*/
//__weak void USBH_FTDI_ReceiveCallback(USBH_HandleTypeDef *phost)
//{
//
//}

  /**
* @brief  The function informs user that Settings have been changed
*  @param  pdev: Selected device
* @retval None
*/
__weak void USBH_FTDI_LineCodingChanged(USBH_HandleTypeDef *phost)
{

}


static int ftdi_to_clkbits_AM(int baudrate, unsigned long *encoded_divisor)

{
    static const char frac_code[8] = {0, 3, 2, 4, 1, 5, 6, 7};
    static const char am_adjust_up[8] = {0, 0, 0, 1, 0, 3, 2, 1};
    static const char am_adjust_dn[8] = {0, 0, 0, 1, 0, 1, 2, 3};
    int divisor, best_divisor, best_baud, best_baud_diff;
    int i;
    divisor = 24000000 / baudrate;

    // Round down to supported fraction (AM only)
    divisor -= am_adjust_dn[divisor & 7];

    // Try this divisor and the one above it (because division rounds down)
    best_divisor = 0;
    best_baud = 0;
    best_baud_diff = 0;
    for (i = 0; i < 2; i++)
    {
        int try_divisor = divisor + i;
        int baud_estimate;
        int baud_diff;

        // Round up to supported divisor value
        if (try_divisor <= 8)
        {
            // Round up to minimum supported divisor
            try_divisor = 8;
        }
        else if (divisor < 16)
        {
            // AM doesn't support divisors 9 through 15 inclusive
            try_divisor = 16;
        }
        else
        {
            // Round up to supported fraction (AM only)
            try_divisor += am_adjust_up[try_divisor & 7];
            if (try_divisor > 0x1FFF8)
            {
                // Round down to maximum supported divisor value (for AM)
                try_divisor = 0x1FFF8;
            }
        }
        // Get estimated baud rate (to nearest integer)
        baud_estimate = (24000000 + (try_divisor / 2)) / try_divisor;
        // Get absolute difference from requested baud rate
        if (baud_estimate < baudrate)
        {
            baud_diff = baudrate - baud_estimate;
        }
        else
        {
            baud_diff = baud_estimate - baudrate;
        }
        if (i == 0 || baud_diff < best_baud_diff)
        {
            // Closest to requested baud rate so far
            best_divisor = try_divisor;
            best_baud = baud_estimate;
            best_baud_diff = baud_diff;
            if (baud_diff == 0)
            {
                // Spot on! No point trying
                break;
            }
        }
    }
    // Encode the best divisor value
    *encoded_divisor = (best_divisor >> 3) | (frac_code[best_divisor & 7] << 14);
    // Deal with special cases for encoded value
    if (*encoded_divisor == 1)
    {
        *encoded_divisor = 0;    // 3000000 baud
    }
    else if (*encoded_divisor == 0x4001)
    {
        *encoded_divisor = 1;    // 2000000 baud (BM only)
    }
    return best_baud;
}


static int ftdi_to_clkbits(int baudrate, unsigned int clk, int clk_div, unsigned long *encoded_divisor)
 {
     static const char frac_code[8] = {0, 3, 2, 4, 1, 5, 6, 7};
     int best_baud = 0;
     int divisor, best_divisor;
     if (baudrate >=  clk/clk_div)
     {
         *encoded_divisor = 0;
         best_baud = clk/clk_div;
     }
     else if (baudrate >=  clk/(clk_div + clk_div/2))
     {
         *encoded_divisor = 1;
         best_baud = clk/(clk_div + clk_div/2);
     }
     else if (baudrate >=  clk/(2*clk_div))
     {
         *encoded_divisor = 2;
         best_baud = clk/(2*clk_div);
     }
     else
     {
         /* We divide by 16 to have 3 fractional bits and one bit for rounding */
         divisor = clk*16/clk_div / baudrate;
         if (divisor & 1) /* Decide if to round up or down*/
             best_divisor = divisor /2 +1;
         else
             best_divisor = divisor/2;
         if(best_divisor > 0x20000)
             best_divisor = 0x1ffff;
         best_baud = clk*16/clk_div/best_divisor;
         if (best_baud & 1) /* Decide if to round up or down*/
             best_baud = best_baud /2 +1;
         else
             best_baud = best_baud /2;
         *encoded_divisor = (best_divisor >> 3) | (frac_code[best_divisor & 0x7] << 14);
     }
     return best_baud;
 }
 /**
     ftdi_convert_baudrate returns nearest supported baud rate to that requested.
     Function is only used internally
     \internal
 */
static int ftdi_convert_baudrate(int baudrate, FTDI_HandleTypeDef* ftdi,
										 unsigned short *value, unsigned short *index)
{
  int best_baud;
  unsigned long encoded_divisor;

  if (baudrate <= 0)
  {
		// Return error
		return -1;
  }

#define H_CLK 120000000
#define C_CLK  48000000
  if ((ftdi->type == TYPE_2232H) || (ftdi->type == TYPE_4232H) || (ftdi->type == TYPE_232H))
  {
		if(baudrate*10 > H_CLK /0x3fff)
		{
			 /* On H Devices, use 12 000 000 Baudrate when possible
				 We have a 14 bit divisor, a 1 bit divisor switch (10 or 16)
				 three fractional bits and a 120 MHz clock
				 Assume AN_120 "Sub-integer divisors between 0 and 2 are not allowed" holds for
				 DIV/10 CLK too, so /1, /1.5 and /2 can be handled the same*/
			 best_baud = ftdi_to_clkbits(baudrate, H_CLK, 10, &encoded_divisor);
			 encoded_divisor |= 0x20000; /* switch on CLK/10*/
		}
		else
			 best_baud = ftdi_to_clkbits(baudrate, C_CLK, 16, &encoded_divisor);
  }
  else if ((ftdi->type == TYPE_BM) || (ftdi->type == TYPE_2232C) || (ftdi->type == TYPE_R) || (ftdi->type == TYPE_230X))
  {
		best_baud = ftdi_to_clkbits(baudrate, C_CLK, 16, &encoded_divisor);
  }
  else
  {
		best_baud = ftdi_to_clkbits_AM(baudrate, &encoded_divisor);
  }
  // Split into "value" and "index" values
  *value = (unsigned short)(encoded_divisor & 0xFFFF);
  if (ftdi->type == TYPE_2232H || ftdi->type == TYPE_4232H || ftdi->type == TYPE_232H)
  {
		*index = (unsigned short)(encoded_divisor >> 8);
		*index &= 0xFF00;
		*index |= ftdi->index;
  }
  else
		*index = (unsigned short)(encoded_divisor >> 16);

  // Return the nearest baud rate
  return best_baud;
}
/**
* @}
*/

/**
* @}
*/

/**
* @}
*/


/**
* @}
*/


/**
* @}
*/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
